'''Вариант 11. Дано двузначноечисло.Вывести в начале его левую цифру (десятки),
а затем — его правую цифру (единицы).
Для нахождения десятков использовать операцию деления нацело,
для нахождения единиц — операцию взятия остатка от деления.

Вариант 12. Дано двузначное число. Найти сумму и произведение его цифр.

Вариант 13. Дано двузначное число.
Вывести число, полученное при перестановке цифр исходного числа.
'''

while True:
    try:
        a = int(input("Введите двузначное число: "))
        if a < 10 or a > 99:
            print("Введите двузначное число!")
        else:
            tens, units = divmod(a,10)
            # Вариант 11
            print(f"Десяток {tens} Единица {units}")

            # Вариант 12
            print(f"Сумма цифр двузначного числа: {tens + units} и произведение цифр двузначного числа: {tens * units}")

            # Вариант 13
            print(f"Перевернутое число: {units * 10 + tens}")
            break
    except ValueError:
        print("Вводите число!! Пробуйте заново")