"""
Вариант 6. Дано расстояние L в сантиметрах. Используя операцию деления
нацело, найти количество полных метров в нем (1 метр = 100 см).
"""

while True:
    try:
        l_cm = int(input("Введите расстояние в сантиметрах: "))

        if l_cm <= 0:
            print("Расстояние должно быть больше нуля! Попробуйте еще раз.\n")
        else:
            meters, remaining_cm = divmod(l_cm, 100)

            print(f"Количество полных метров в {l_cm} см: {meters}")
            print(f"Оставшиеся сантиметры: {remaining_cm}")

            break

    except ValueError:
        print("Ошибка ввода: нужно ввести целое число. Пожалуйста, попробуйте еще раз.\n")