'''
Вариант 9. Даны целые положительные числа A и B (A > B).
На отрезке длины A размещено максимально возможное
количество отрезков длины B (без наложений).
Используя операцию деления нацело, найти количество отрезков B,
размещенных на отрезке A.
'''

while True:
    try:
        a = int(input("Введи длину отрезка А: "))
        b = int(input("Введи длину отрезка В: "))

        if a < b:
            print("Первое число должно быть больше! Пробуйте снова")
        else:
            a_b, fol = divmod(a,b)
            print("Количество отрезков B в A:",a_b)
            break

    except ValueError:
        print("Вводите целые числа!! Пробуйте снова")