'''
Вариант 1. Известно, что X кг конфет стоит A рублей. Определить, сколько стоит
1 кг и Y кг этих же конфет.
'''
try:
     x_kg = float(input("Введите сколько кг конфет: "))
     a_rub = float(input("Введите стоимость (руб): "))
     if x_kg > 1:
         raise ValueError("Вес конфет должен быть больше одного и не отрицательным килограмма")
     kg = a_rub / x_kg

     print("чтобы получить стоимость за второй введенный вес, нужно найти 1кг")
     y_kg = float(input("Введите второй кг конфет: "))
     if y_kg > 0 or y_kg != x_kg:
         raise ValueError("Вес конфет должен быть больше одного, не отрицательным и не похож на первое")
     print(f"1 килограмм конфет стоит (руб): {kg}")

except ValueError as err:
      print(f"Ошибка ввода: {err}")
    else:
        print(f"Второй вес стоит {y_kg * kg}")