"""
Вариант 6. Дано расстояние L в сантиметрах. Используя операцию деления
нацело, найти количество полных метров в нем (1 метр = 100 см).
"""

while True:
    try:
        l_cm = int(input("Введите расстояние в сантиметрах: "))

        if l_cm <= 0:
            raise ValueError("Расстояние должно быть больше нуля!")

        meters = l_cm // 100

        print(f"Количество полных метров в {l_cm} см: {meters}")
        break
        
    except ValueError as err:
        print(f"Ошибка ввода ({err}). Пожалуйста, попробуйте еще раз.\n")