'''Скорость лодки в стоячей воде V км/ч, скорость течения реки U км/ч
(U < V). Время движения лодки по озеру T1 ч, а по реке (против течения) — T2 ч. Определить
путь S, пройденный лодкой (путь = время • скорость). Учесть, что при движении против
течения скорость лодки уменьшается на величину скорости течения'''
while True:
    try:
        v = float(input("Введите скорость лодки в стоячей воде (км/ч): "))
        u = float(input("Введите скорость течения реки (км/ч): "))
        t1 = float(input("Введите время пути по озеру (ч): "))
        t2 = float(input("Введите время пути по реке (ч): "))

        if v <= 0 or u <= 0 or t1 <= 0 or t2 <= 0:
            raise ValueError("Все значения должны быть строго больше нуля!")

        if u >= v:
            raise ValueError("Скорость течения должна быть меньше скорости лодки!")

        v_protiv = v - u
        print("Скорость против течения: ", v_protiv)

        s_lake = v * t1
        print("Путь по озеру: ", s_lake)

        s_river = v_protiv * t2
        print("Путь по реке: ", s_river)

        s = s_lake + s_river
        print("Общий путь лодки:", s)

        break
    except ValueError as err:
        print(f"Вводите данные правильно ({err}). Пожалуйста, попробуйте еще раз")