'''Вариант 14. Дано трехзначное число.
Используя одну операцию деления нацело,
вывести первую цифру данного числа (сотни).

Вариант 15. Дано трехзначное число.
Вывести вначале его последнюю цифру (единицы),
а затем — его среднюю цифру (десятки).

Вариант 16. Дано трехзначное число. Найти сумму и произведение его цифр.

Вариант 17. Дано трехзначное число.
Вывести число, полученное при прочтении исходного числа справа налево.

Вариант 18. Дано трехзначное число.
В нем зачеркнули первую слева цифру и приписали ее справа. Вывести

Вариант 19. Дано трехзначное число.
В нем зачеркнули первую справа цифру и приписали ее слева. Вывести полученное число.

Вариант 20. Дано трехзначное число.
Вывести число, полученное при перестановке
цифр сотен и десятков исходного числа (например, 123 перейдет в 213).

Вариант 21. Дано трехзначное число.
Вывести число, полученное при перестановке
цифр десятков и единиц исходного числа (например, 123 перейдет в 132).
'''

while True:
    try:
        num = int(input("Введите трехзначное число: "))
        if num < 100 or num > 999:
            print("Введите трехзначное число!! Повторите снова")
        else:
            hundreds, ostat = divmod(num, 100)
            tens, units = divmod(ostat, 10)
            # Вариант 14 (сотни)
            print(f"Сотни: {hundreds}")
            # Вариант 15 (единицы потом десятки)
            print(f"Единицы: {units}, десятки: {tens}")
            # Вариант 16 (сумма и произведение)
            print(f"Сумма цифр трехзначного: {hundreds + tens + units} и Произведение: {hundreds * units * tens}")
            # Вариант 17
            print(f"число справа налево: {tens * 10 + units * 100 + hundreds}")
            # Вариант 18
            print(f"Число у которого первая цифра теперь послденяя: {tens * 100 + units * 10 + hundreds}")
            break
    except ValueError:
        print("Вводите число!!")
