'''Вариант 11. Дано двузначноечисло.Вывести в начале его левую цифру (десятки),
а затем — его правую цифру (единицы).
Для нахождения десятков использовать операцию деления нацело,
для нахождения единиц — операцию взятия остатка от деления.'''

while True:
    try:
        a = int(input("Введите двузначное число: "))
        if a < 10 or a > 99:
            print("Введите двузначное число!")
        else:
            tens, units = divmod(a,10)
            print(f"Десяток {tens} Единица {units}")
            break
    except ValueError:
        print("Вводите число!! Пробуйте заново")