''' Вариант 5. Скорость первого автомобиля Vi км/ч, второго — V2 км/ч, расстояние
между ними S км. Определить расстояние между ними через T часов, если автомобили
первоначально движутся навстречу друг другу. Данное расстояние равно модулю разности
начального расстояния и общего пути, проделанного автомобилями; общий путь = время •
суммарная скорость.'''
try:
    v1 = float(input("Введите скорость первого автомобиля..."))
    v2 = float(input("Введите скорость второго автомобиля..."))
    S = float(input("Введите начальное расстояние..."))
    T = float(input("Введите время..."))

    if v1 < 0 or v2 < 0 or S < 0 or T < 0:
        raise ValueError("Время, скорость, расстояние и время не могут быть отрицательными")

    distance = S - T * (v1 + v2)

except ValueError as err:
    print(f"Ошибка ввода: {err}")
else:
    print(f"Расстояние между ними через {T} ч: {distance:.2f} км.")
